//TVM Vulnerabilites (critical 1days)

let newVuln = DeviceTvmSoftwareVulnerabilitiesKB
| where VulnerabilitySeverityLevel == "Critical"
| where LastModifiedTime >ago(1day); DeviceTvmSoftwareVulnerabilities
| join newVuln on CveId
| summarize dcount(DeviceId) by DeviceName, DeviceId, Timestamp=LastModifiedTime, SoftwareName, SoftwareVendor, SoftwareVersion, VulnerabilitySeverityLevel, CvssScore, IsExploitAvailable
| project Timestamp, DeviceName, SoftwareName, SoftwareVendor, SoftwareVersion, VulnerabilitySeverityLevel, CvssScore, IsExploitAvailable, DeviceId

//URL: https://github.com/jangeisbauer/AdvancedHunting/blob/master/Detected%20new%20Vuln%20in%20Enterprise

DeviceTvmSoftwareVulnerabilities
| project DeviceName, SoftwareName, CveId, SoftwareVersion, VulnerabilitySeverityLevel
| join (DeviceTvmSoftwareVulnerabilitiesKB
| project AffectedSoftware, VulnerabilityDescription , CveId , CvssScore , IsExploitAvailable) on CveId
| project CveId , SoftwareName , SoftwareVersion , VulnerabilityDescription , VulnerabilitySeverityLevel, IsExploitAvailable , CvssScore
| distinct SoftwareName , SoftwareVersion, CveId, VulnerabilityDescription , VulnerabilitySeverityLevel, IsExploitAvailable
| sort by SoftwareName asc , SoftwareVersion
