AuditLogs 
| where Category == "Policy"
| project  ActivityDateTime, ActivityDisplayName , TargetResources[0].displayName, InitiatedBy.user.userPrincipalName

SigninLogs
| where ConditionalAccessStatus == "success"
| project AppDisplayName, Identity, ConditionalAccessStatus  
