// View ASR audit events - but remove repeating events (e.g. multiple events with same machine, rule, file and process) 
DeviceEvents 
| where ActionType startswith "ASR" and ActionType endswith "Audited" 
| summarize Timestamp =max(Timestamp) by DeviceName, ActionType,FileName, FolderPath, InitiatingProcessCommandLine, InitiatingProcessFileName, InitiatingProcessFolderPath, InitiatingProcessId, SHA1 
