// Summarize Threats (Detection Methods) in all Email Events
EmailEvents
| where Timestamp > ago(7d)
| where isnotempty (ThreatTypes)
| summarize count() by DetectionMethods

// Project details related to emailattachment threats that is not empty
EmailAttachmentInfo
| where Timestamp > ago(3d)
| where isnotempty (ThreatTypes)
| project Timestamp, SenderFromAddress, RecipientEmailAddress, FileName, FileType, ThreatTypes , ThreatNames, DetectionMethods
| order by ThreatNames
